; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	infrared3 - mode
	spectrograph4 - mode
	image2 - mode
	spectrograph1 - mode
	infrared0 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	Planet3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph4)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet3)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 infrared3)
	(supports instrument7 image2)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument9 image2)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument10 infrared3)
	(supports instrument10 spectrograph4)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 Star0)
	(supports instrument11 image2)
	(supports instrument11 spectrograph4)
	(supports instrument11 infrared0)
	(calibration_target instrument11 Star0)
	(supports instrument12 infrared0)
	(supports instrument12 spectrograph1)
	(supports instrument12 image2)
	(calibration_target instrument12 GroundStation1)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(pointing satellite2 Planet8)
	(pointing satellite4 Star4)
	(have_image Planet3 image2)
	(have_image Star4 spectrograph4)
	(have_image Star5 spectrograph4)
	(have_image Star6 spectrograph4)
	(have_image Star7 spectrograph4)
	(have_image Planet8 infrared3)
	(have_image Planet9 infrared3)
	(have_image Phenomenon10 image2)
	(have_image Phenomenon11 infrared0)
	(have_image Planet12 infrared0)
	(have_image Star13 spectrograph4)
	(have_image Star14 spectrograph4)
	(have_image Planet16 image2)
	(have_image Planet17 spectrograph1)
	(have_image Phenomenon18 image2)
	(have_image Phenomenon19 image2)
	(have_image Phenomenon20 image2)
	(have_image Star21 infrared0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 21
2. (calibrate satellite4 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 0 of 21
3. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 21
4. (calibrate satellite2 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 21
5. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 21
6. (turn_to satellite4 planet17 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet17)
   goals met: 0 of 21
7. (take_image satellite4 planet17 instrument10 spectrograph1)
   added: (have_image planet17 spectrograph1)
   goals met: 1 of 21
8. (turn_to satellite4 planet8 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet8)
   goals met: 1 of 21
9. (take_image satellite4 planet8 instrument10 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 2 of 21
10. (turn_to satellite4 planet9 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet9)
   goals met: 2 of 21
11. (take_image satellite4 planet9 instrument10 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 3 of 21
12. (turn_to satellite4 star13 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star13)
   goals met: 3 of 21
13. (take_image satellite4 star13 instrument10 spectrograph4)
   added: (have_image star13 spectrograph4)
   goals met: 4 of 21
14. (turn_to satellite4 star14 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star14)
   goals met: 4 of 21
15. (take_image satellite4 star14 instrument10 spectrograph4)
   added: (have_image star14 spectrograph4)
   goals met: 5 of 21
16. (turn_to satellite4 star4 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star4)
   goals met: 6 of 21
17. (take_image satellite4 star4 instrument10 spectrograph4)
   added: (have_image star4 spectrograph4)
   goals met: 7 of 21
18. (turn_to satellite2 phenomenon10 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon10)
   goals met: 7 of 21
19. (take_image satellite2 phenomenon10 instrument7 image2)
   added: (have_image phenomenon10 image2)
   goals met: 8 of 21
20. (turn_to satellite2 phenomenon18 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon18)
   goals met: 8 of 21
21. (take_image satellite2 phenomenon18 instrument7 image2)
   added: (have_image phenomenon18 image2)
   goals met: 9 of 21
22. (turn_to satellite2 phenomenon19 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon19)
   goals met: 9 of 21
23. (take_image satellite2 phenomenon19 instrument7 image2)
   added: (have_image phenomenon19 image2)
   goals met: 10 of 21
24. (turn_to satellite2 phenomenon20 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 phenomenon20)
   goals met: 10 of 21
25. (take_image satellite2 phenomenon20 instrument7 image2)
   added: (have_image phenomenon20 image2)
   goals met: 11 of 21
26. (turn_to satellite2 planet16 phenomenon20)
   deleted: (pointing satellite2 phenomenon20)
   added: (pointing satellite2 planet16)
   goals met: 11 of 21
27. (take_image satellite2 planet16 instrument7 image2)
   added: (have_image planet16 image2)
   goals met: 12 of 21
28. (turn_to satellite2 planet3 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet3)
   goals met: 12 of 21
29. (take_image satellite2 planet3 instrument7 image2)
   added: (have_image planet3 image2)
   goals met: 13 of 21
30. (turn_to satellite2 planet8 planet3)
   deleted: (pointing satellite2 planet3)
   added: (pointing satellite2 planet8)
   goals met: 14 of 21
31. (turn_to satellite1 phenomenon11 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 phenomenon11)
   goals met: 14 of 21
32. (turn_to satellite1 star0 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star0)
   goals met: 14 of 21
33. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 14 of 21
34. (turn_to satellite1 phenomenon11 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon11)
   goals met: 14 of 21
35. (take_image satellite1 phenomenon11 instrument4 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 15 of 21
36. (turn_to satellite1 planet12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet12)
   goals met: 15 of 21
37. (take_image satellite1 planet12 instrument4 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 16 of 21
38. (turn_to satellite1 star21 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star21)
   goals met: 16 of 21
39. (take_image satellite1 star21 instrument4 infrared0)
   added: (have_image star21 infrared0)
   goals met: 17 of 21
40. (turn_to satellite0 phenomenon10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon10)
   goals met: 18 of 21
41. (turn_to satellite4 star5 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star5)
   goals met: 17 of 21
42. (take_image satellite4 star5 instrument10 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 18 of 21
43. (turn_to satellite4 star4 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star4)
   goals met: 19 of 21
44. (turn_to satellite2 star6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star6)
   goals met: 18 of 21
45. (take_image satellite2 star6 instrument7 spectrograph4)
   added: (have_image star6 spectrograph4)
   goals met: 19 of 21
46. (turn_to satellite2 planet8 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet8)
   goals met: 20 of 21
47. (turn_to satellite4 star7 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star7)
   goals met: 19 of 21
48. (take_image satellite4 star7 instrument10 spectrograph4)
   added: (have_image star7 spectrograph4)
   goals met: 20 of 21
49. (turn_to satellite4 star4 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star4)
   goals met: 21 of 21
